Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །སེར་སྣ་ཞི་སྟེ་མ་ལུས་སྤངས། །གང་ཞིག་དུལ་བའི་སྤྱོད་གྲུབ་པ།
en: Thereby, their miserliness was pacified and entirely abandoned.

source: །དཔག་མེད་ཆོས་ནི་འདི་ཐོས་པས།
en: By hearing those boundless teachings, Those who had accomplished disciplined actions

source: །མང་དུ་ཐོས་པའི་མཚོར་ཞུགས་ནས།
en: Entered an ocean of erudition

source: །ཀུན་འཛིན་སྒོ་ནི་སྒྲུབ་པར་བྱེད།
en: And accomplished the gateway of thorough comprehension.

source: །གཞན་ཡང་མཁའ་ལས་སྒྲ་ཐོས་པས།
en: When they heard those words manifested from the sky,

source: །མེ་ཏོག་དག་གིས་སངས་རྒྱས་མཆོད།
en: They worshiped the Buddha with offerings of flowers,

source: །ཡོན་ཏན་ཁྱད་པར་འཕགས་སྒྲུབ་ཅིང་།
en: Accomplished exalted qualities,

source: །སྙིང་རྗེ་ཆེན་པོའི་རྫུ་འཕྲུལ་སྟོན།
en: And displayed the miraculous power of great compassion.

source: །བཅོམ་ལྡན་སྐུ་དང་སྐྱེ་གནས་དང་། །གདུང་རྒྱུད་དང་ནི་གསུང་སྒྲ་རྣམས།
en: Of the Blessed One’s body, his birthplace, His family lineage, and the sound of his speech.

source: །ཁྱད་པར་འཕགས་པའི་བསྔགས་པ་བརྗོད།
en: He gave teachings through a variety of miraculous powers,

source: །སེམས་ཅན་འགྲོ་བ་ཇི་ལྟ་བར། །རྫུ་འཕྲུལ་དག་ཀྱང་ཅི་རིགས་བཤད།
en: In accordance with the different sentient beings;

source: །མིག་དང་རྣ་བ་སྣ་ལྕེ་ལུས།
en: He gave eminent teachings related to the eyes, the ears, the nose, the tongue, the body,

source: །གཟུགས་དང་སྒྲ་ལ་སོགས་པ་དང་། །བསྐུམ་པ་དང་ནི་བརྐྱང་བ་དག །སྟོན་པར་མཛད་པ་ཁྱད་པར་འཕགས།
en: Forms, sounds, and so forth, as well as the contraction and stretching of the limbs.

source: །བཅོམ་ལྡན་འཇིག་རྟེན་འདས་པས་ན།
en: Since the Blessed One has transcended the world,

source: །འཇིག་རྟེན་སྒྲོན་མ་རབ་མཛད་ཅིང་།
en: He acts as a torch within the worlds

source: །གཟུགས་ནི་མང་པོ་སྟོན་པ་ཡང་།
en: And manifests many forms;

source: །ཐམས་ཅད་སངས་རྒྱས་རྫུ་འཕྲུལ་ཡིན།
en: All these are the Buddha’s miraculous powers. He gave different teachings

source: །སྣོད་དང་སྣོད་མིན་དེ་རྗེས་སུ། །མི་འཐུན་ཆོས་ནི་སྟོན་མཛད་པས།
en: To those who were suitable vessels and those who were not:

source: །སེམས་ཅན་ཚེ་རབས་ཚད་མེད་ནས། །སངས་རྒྱས་མཆོད་པ་མ་བྱས་ཤིང་།
en: To those who had never worshiped the buddhas in countless lifetimes,

source: །དམུ་རྒོད་གདུལ་བར་དཀའ་བ་ལ། །སེམས་ཅན་དམྱལ་བར་བཤད་པར་མཛད།
en: And to the unruly ones who were hard to tame, he taught about the hell realms.

source: །གང་ཞིག་ལས་ལམ་རྨོངས་གྱུར་ཅིང་།
en: For those who were deluded about karmic deeds

source: །ལྟ་ལ་བརྟེན་ནས་སྤྲོས་དགའ་བ།
en: And indulged in concepts while relying on views, The Blessed One manifested the words related to

source: །བཅོམ་ལྡན་དེ་དག་ལྟ་བ་དང་། །སྤྲོས་པ་ཞི་བའི་སྒྲ་ཐོས་མཛད།
en: The pacification of views and concepts.

source: །གཞན་ཡང་མཁའ་ལས་ངོ་བོ་ཉིད།
en: The words related to the essential nature,

source: །ངེས་པ་ཉིད་དུ་སྟོང་པ་དང་། །འགྲོ་འོང་མེད་ཅིང་མཚན་མེད་དང་། །ཅི་ཡང་མེད་པའི་སྒྲ་ཡང་ཐོས།
en: Definitive emptiness, the absence of coming and going, The absence of marks, and complete nonexistence Were also heard from the sky.

source: །གཞན་ཡང་སེམས་ཅན་བརྒྱ་སྟོང་དག །མཁའ་ལས་ཤ་དང་ཤེས་རབ་སྤྱན།
en: A hundred thousand sentient beings Also heard from the sky the words of instruction Related to the eye of flesh and the eye of insight,

source: །དེ་བཞིན་ཆོས་ཀྱི་སྤྱན་བར་དུ། །ཡང་དག་སྟོན་པའི་སྒྲ་ཡང་ཐོས།
en: Up to the Dharma eye.

source: །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི།
en: Through the Blessed One’s miraculous powers,

source: །ཚུལ་ཁྲིམས་ཏིང་འཛིན་ཤེས་རབ་སྒྲ།
en: The words of instruction related to discipline,

source: །རྣམ་གྲོལ་རྣམ་གྲོལ་མཐོང་བའི་སྒྲ།
en: Absorption, insight, liberation, and liberated vision

source: །སྟོན་པ་དག་ཀྱང་ཐོས་པར་གྱུར། །སེམས་ཅན་དག་ནི་ཇི་སྙེད་ལ།
en: Were also heard.

source: །ཇི་བཞིན་རྫུ་འཕྲུལ་རབ་བསྟན་ནས། །ཇི་ལྟར་རྗེས་འཐུན་སྒྲ་སྐད་ཀྱིས།
en: Through the manifestation of miraculous displays,

source: །ཡང་དག་ཆོས་ནི་བསྟན་པར་མཛད།
en: He taught the genuine Dharma

source: །སེམས་ཅན་ལ་ལ་གང་ཞིག་ནི།
en: To all sentient beings Using the appropriate words. For those beings who were inspired by

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་བསྒྲུབ་མོས།
en: The practices of generosity, discipline, and patience,

source: །རྫུ་འཕྲུལ་མོས་པ་ཇི་ལྟ་བཞིན། །སྦྱིན་དང་ཚུལ་ཁྲིམས་བཟོད་སྒྲ་སྟོན།
en: He miraculously manifested the words of generosity, discipline, and patience, In accordance with their inclinations.

source: །སེམས་ཅན་དབང་པོ་ཇི་ལྟ་བཞིན། །རྒྱ་ཆེར་ཡང་དག་འབྱེད་མཛད་པས།
en: In accordance with sentient beings’ faculties,

source: །ལེན་འཛིན་སྟོན་ལ་དགོད་པར་མཛད།
en: And caused them to adopt the teaching, retain it, and teach it.

source: །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་ཀྱི།
en: Concerning the aggregates, elements, and sense sources,

source: །བཅིངས་དང་གྲོལ་དང་ཉེ་རིང་དང་། །ས་ཡི་གནས་སྐབས་བྱེ་བྲག་གི།
en: And related to the characteristics of the particular contexts of the bodhisattva levels.

source: །མཚན་ཉིད་སྟོན་པ་ཐོས་པར་གྱུར། །གཞན་ཡང་ས་དང་ཡེ་ཤེས་ཀྱི།
en: They also heard teachings related to the bodhisattva levels

source: །འོད་ཟེར་ཚད་མེད་སྟོན་པ་དང་། །ཉོན་མོངས་བག་ཆགས་སྤངས་པ་དང་། །སྤངས་མིན་སྟོན་པ་ཐོས་པར་གྱུར།
en: And the infinite light rays of wisdom, As well as teachings related to the abandonment and nonabandonment Of the afflictions and their latent patterns.

source: །ལྷ་དང་མི་ཡི་ངོ་བོ་ཉིད།
en: They also heard teachings related to the nature of gods and humans, And to the various types of rebirth

source: །ལས་དང་འབྲས་བུ་མི་མཚུངས་པས། །སྐྱེ་ལེན་ཐ་དད་ཐོས་པར་གྱུར།
en: Caused by different actions and their results.

source: །རེས་འགའ་བུད་མེད་མདུན་དག་ཏུ། །བུད་མེད་བརྒྱན་པའི་ལུས་སྤྲུལ་ནས།
en: At times, he emanated women with ornamented bodies In front of the women present,

source: །མཁའ་ལས་སྐྱོ་སྟོན་སྒྲ་བསྒྲགས་པས།
en: And words of instruction related to weariness then resounded in the sky,

source: །གང་ཐོས་འདོད་ཆགས་སེལ་བར་མཛད།
en: Eliminating the desires of all those who heard them. Through his compassion, he taught the unsurpassed Dharma

source: །ཤཱ་རིའི་བུ་ནི་ཇི་ལྟ་བཞིན།
en: To those who—like Śāriputra—

source: །ཤིན་དུ་དང་བ་སྐྱེས་གྱུར་པ།
en: Had developed intense faith,

source: །ཐུགས་རྗེས་མོས་པ་ཇི་བཞིན་དུ།
en: In accordance with their inclinations.

source: །བླ་མེད་ཆོས་ནི་སྟོན་པར་མཛད།
en: The hearers—Maudgalyāyana, Kāśyapa,

source: །མཽད་གལ་བུ་དང་འོད་སྲུང་དང་། །ཀ་པི་ན་དང་ཀུན་དགའ་དང་། །འོད་སྲུང་ཆེན་པོ་དག་དང་ནི།
en: Kaphina, Ānanda, Mahākāśyapa,

source: །ཀུན་ཤེས་ཀཽ་དི་ནྱ་ལ་སོགས། །དེ་དག་མོས་པ་ཇི་བཞིན་དུ།
en: Ājñātakauṇḍinya, and others—

source: །ཉན་ཐོས་ཆོས་སྟོན་ཐོས་པར་གྱུར།
en: Heard Dharma teachings that accorded with their inclinations.

source: །ལྷ་རྣམས་དང་ནི་ལྷ་མ་ཡིན། །གནོད་སྦྱིན་དག་ནི་མང་པོ་དང་། །བེ་རོ་ཀ་ནི་འཁོར་བཅས་དང་། །གྲུལ་བུམ་དག་ནི་ཚད་མེད་རྣམས། །བཅོམ་ལྡན་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི།
en: The many gods, asuras, and yakṣas, Virūḍhaka with his retinue, and the countless kumbhāṇḍas

source: །གཟུངས་སྔགས་སྒྲ་ནི་ཐོས་པར་གྱུར། །ཨི་དི་སི། བི་དི་སི། ཨི་ར་སུ། ཨི་ར། ཨཽ་ན་སི། །མ་ན་སི། ཨུ་ཁྱི། ཨ་ནོ་ཁྱི། ཨཱ་ཁི་ཙ་ལ་མང་ནཾ་ཡེ། དར་ནི་ཤྠ་ནི་མི། ཏ་ཀ་ནི། ཨེ་མི་མན་ཏྲ། ནི་ཧ་ར། ཨ་བུ་རེ། བུད་དྷེ། ནི་རེ། ཨ་ཁི་ཚ་ར། བི་ཡ་ཀི་རི་ཡ་ཏེ། ཨ་ཁི་ཚ་ར་བ་ར་མི་ཏེ། ཀ་ལཱ་བ་ཧི་ནི།
en: Heard the words of this dhāraṇī mantra

source: སརྦོ་བིང་ཤི་ནི་ར་དྷེ་པཽ་ན། པ་ར་ཤ་སད་ཏེ། ཤ་ས་ཏ། པ་ར་ཤ་སད་ཏ། ཏ་ར་སད་ཏ། བྷཱུ་མི། ཨཱ་མ་བྷ་ར། ལི་ལ་བྷ་ན། ཤི་ཙ་ཙིད་ཏ། པི་བ་མ་ཏི།
en: Through the Blessed One’s miraculous powers:

source: ཙིད་ཏ་ཨ་ནན་ཏ། ཨོ་བེ་ར་ཧ་བ་མི་ཏ་བྷུ་མི། ན་ན་མ་ཀཱ་ནི། ཨ་ཀ་ནི་བི་བྷི་མིད་ཏེ། ཤ་རི་བི་ཤྠ། ཨ་མ་ལ་ནི་མ་ལཱ། བཱུ་ལི་ཏེ་ན་ར་ཤི་ཙ། ཧ་ཧ་རི། མ་མ་ལཱི།
en: Idisi vidisi irasu ira aunasi manasi ukhyi anokhyi akhicalamangnaṃye darniṣṭhanimi takani emimantra nihara apure buddhe nire akhichara viyakiriyate akhichara­paramite kalāvahini sarvobiṅ-śiniradhevauna paraśasdate śasta paraśasdata tarasdata bhūmi āmabhara lilabhana śicacidata vivamati cidata-ananta oberahavamita­bhūmi nanamkāni akanivibhimidate śariviṣṭha amalanimalā pūlitena raśi ca hahari mamalī bharani tiṣṭha cakṣunirahara udharitapaci antari kutari ketu suketu suparani karani kusumaniyai kakari kakhari upalamūri tiṣṭha ṅarani nāganirahare paraldate ateparayate anatarabhandhe anataratabhatiśi ca hasiri makhali īnisambhare tiṣṭha sittarani kubhulocate.

source: བྷ་ར་ནི་ཏི་ཤྠ། ཙ་ཀྵུ་ནིར་ཧ་ར། ཨུ་དྷ་རི་ཏ་པ་ཙི། ཨན་ཏ་རི། ཀུ་ཏ་རི། ཀེ་ཏུ་སུ་ཀེ་ཏུ་སུ་པ་རི་ནི། ཀ་ར་ནི། ཀུ་སུ་མ་ནི་ཡཻ། ཀ་ཀ་རི། ཀ་ཁ་རི། ཨུ་པ་ལ་མཱུ་རི། ཏི་ཤྠང་ར་ནི། ནཱག་ནི་ར་ཧ་རེ། པ་ར་ལད་ཏེ། ཨ་ཏེ་པ་ར་ཡ་ཏེ། ཨན་ཏ་རབྷན་དྷེ། ཨན་ཏ་ར་ཏ་བྷ་ཏི་ཤི་ཙ། ཧ་སི་ར། མ་ཁ་ལི། ཨཱི་ནི་སམ་བྷ་རེ། ཏི་ཤྠ་སིཏྟ་ར་ནི། ཀུ་བྷུ་ལོ་ཙ་ཏེ།
en: Vaiśravaṇa, Dhṛtarāṣṭra,

source: གཞན་ཡང་རྒྱལ་པོ་རྣམ་ཐོས་བུ། །ཡུལ་འཁོར་སྲུང་ནི་ལ་སོགས་པས།
en: And the other guardian kings Recited the syllables of this mantra of truth

source: །ཁྱད་འཕགས་སྒྲ་ནི་གྲངས་མེད་ཀྱིས། །བདེན་པའི་སྔགས་ཚིག་རབ་ཏུ་སྨྲས།
en: With countless magnificent tunes.

source: །ཚད་མེད་སྒྲ་ནི་དེ་དག་ཀྱང་།
en: Those limitless tunes manifested

source: །བདེ་གཤེགས་རྫུ་འཕྲུལ་དབང་གིས་བྱུང་།
en: Through the Blessed One’s miraculous powers.

source: །རྫུ་འཕྲུལ་དག་ནི་ཚད་མེད་པས།
en: Since those miraculous powers were endless,

source: །བསྟན་པ་དག་ཀྱང་ཚད་མེད་པས།
en: The teachings, too, were endless.

source: །རེས་འགའ་སངས་རྒྱས་མེད་ཞིང་དུ། །རྫུ་འཕྲུལ་རོལ་བའི་སྟོབས་དག་གིས།
en: At times, through the power of those miraculous displays,

source: །འཁོར་བསྐོར་སངས་རྒྱས་སྐུ་སྟོན་པ།
en: The bodies of buddhas turning the Dharma wheel—

source: །ད་ལྟར་མཐོང་བ་ཇི་བཞིན་ནོ།
en: Just as the one seen today— Were manifested in realms devoid of a buddha.

source: །བསམ་གྱིས་མི་ཁྱབ་ཞིང་དག་ཏུ།
en: In an inconceivable number of realms,

source: །སྤྲུལ་པ་ཚད་མེད་སྟོན་མཛད་པས།
en: He displayed countless emanations of himself

source: །བལྟམས་ནས་གོམ་པ་བདུན་གཤེགས་དང་། །རྒྱལ་སྲིད་སྤངས་ནས་རབ་བྱུང་དང་། །བྱང་ཆུབ་སྙིང་པོར་སངས་རྒྱས་ནས།
en: That walked seven steps right after being born, Gave up their kingdoms, renounced the world, Reached buddhahood on the seat of awakening,

source: །བརྙེས་པའི་ཆོས་དག་རབ་དགོངས་ཏེ།
en: Contemplated the Dharma they had realized,

source: །ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་མཛད་དང་། །མྱ་ངན་འདས་པ་སྟོན་པར་མཛད།
en: And turned the Dharma wheel Before passing into nirvāṇa.

source: །རྫུ་འཕྲུལ་གྱི་ནི་སྟོབས་དག་གིས། །སྣ་ཚོགས་ཆོས་ནི་སྟོན་མཛད་པས།
en: By teaching the Dharma in various ways Through such miraculous powers,

source: །སེམས་ཅན་དག་ནི་ཚད་མེད་རྣམས།
en: He caused countless sentient beings

source: །ཁྱད་འཕགས་ཡེ་ཤེས་གྲུབ་པར་མཛད།
en: To achieve exalted wisdom. At that time, surrounded by the retinue of Brahmā,

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ཚངས་པའི་འཁོར་གྱིས་ཡོངས་བསྐོར་ནས།
en: The great compassionate one

source: །བྱམས་ཆོས་བསྒོམ་པ་བཤད་བསྟན་པས། །བྱམས་པའི་སེམས་ནི་འཕེལ་བར་མཛད།
en: Gave instructions related to the meditation on love, Thereby causing love to increase.

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ལྷ་རྣམས་ཀྱིས་ནི་ཡོངས་བསྐོར་ནས།
en: At that time, surrounded by gods, The great compassionate one

source: །བསྡུ་བའི་དངོས་བཞི་བསྟན་མཛད་པས།
en: Taught the four means of attracting disciples,

source: །བསྡུ་བའི་སྤྱོད་བཞི་འཕེལ་བར་མཛད།
en: Thereby causing those four modes of conduct to develop.

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ཀླུ་རྣམས་ཀྱིས་ནི་ཡོངས་བསྐོར་ནས།
en: At that time, surrounded by nāgas, The great compassionate one

source: །ཞེ་སྡང་ཉེས་དམིགས་བཤད་བསྟན་པས།
en: Gave instructions related to the defects of anger,

source: །ཞེ་སྡང་སེམས་ནི་སྤངས་པར་གྱུར།
en: Thereby causing anger to be abandoned.

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །གནོད་སྦྱིན་རྣམས་ཀྱིས་ཡོངས་བསྐོར་ནས།
en: At that time, surrounded by yakṣas, The great compassionate one

source: །རྣམ་འཚེ་ཉེས་དམིགས་བཤད་བསྟན་པས།
en: Gave instructions related to the defects of violence,

source: །རྣམ་འཚེ་སེམས་ནི་སྤངས་བར་གྱུར།
en: Thereby causing violence to be abandoned. At that time, surrounded by asuras,

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ལྷ་མ་ཡིན་གྱིས་ཡོངས་བསྐོར་ནས།
en: The great compassionate one

source: །འཐབ་པའི་ཉེས་དམིགས་བཤད་བསྟན་ཏེ།
en: Gave instructions related to the defects of strife

source: །བཟོད་པ་བསྒོམས་པའི་བསྔགས་པ་བརྗོད།
en: And proclaimed the praises of the cultivation of patience. At that time, surrounded by garuḍas,

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ནམ་མཁའ་ལྡིང་གིས་ཡོངས་བསྐོར་ནས།
en: The great compassionate one

source: །འགལ་བྱས་ཉེས་དམིགས་བཤད་བསྟན་ཏེ།
en: Gave instructions related to the defects of conflict

source: །འདུམ་པའི་སེམས་ཀྱིས་བསྔགས་པ་མཛད།
en: And proclaimed the praises of reconciliation. At that time, surrounded by a retinue of gandharvas,

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས།
en: The great compassionate one

source: །དྲི་ཟའི་འཁོར་གྱིས་ཡོངས་བསྐོར་ནས།
en: Proclaimed the praises of the thus-gone ones

source: །དགའ་བའི་ཚིག་ནི་དཔག་མེད་ཀྱིས།
en: With innumerable joyous words.

source: །དེ་བཞིན་གཤེགས་པའི་བསྔགས་བརྗོད་བསྟན།
en: At that time, surrounded by a retinue of mahoragas,

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །ལྟོ་འཕྱེ་འཁོར་གྱིས་ཡོངས་བསྐོར་ནས།
en: The great compassionate one

source: །མུ་སྟེགས་ཆོས་ལ་སྨོད་མཛད་ཅིང་།
en: Scorned the Dharma of non-Buddhists

source: །བཅོམ་ལྡན་གསུང་རབ་བསྔགས་བརྗོད་བསྟན།
en: And proclaimed the praises of the excellent scriptures of the blessed ones. At that time, surrounded by a retinue of demons and rākṣasas,

source: །དེ་ཚེ་ཐུགས་རྗེ་ཆེན་པོ་ཡིས། །འདྲེ་སྲིན་འཁོར་གྱིས་ཡོངས་བསྐོར་ནས།
en: The great compassionate one

source: །དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་མཆོག །རྒྱ་ཆེར་བསྔགས་པ་བསྟན་པར་མཛད།
en: Extensively proclaimed the praises Of the thus-gone ones’ supreme qualities.

source: །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་པས།
en: Through the miraculous displays of the great compassionate one,

source: །མིག་ཟད་མཐའ་བསྟན་ཐོས་པས་ན།
en: Heard teachings related to the limit of the exhaustion of the eye

source: །མཐར་ཕྱིན་དོན་ནི་རྟོགས་པར་གྱུར།
en: And realized the ultimate meaning.

source: །མིག་སྐྱེ་མཐའ་ནི་བསྟན་ཐོས་པས།
en: Heard teachings related to the limit of the arising of the eye

source: །མིག་གི་མཐའ་ནི་བསྟན་ཐོས་པས།
en: Heard teachings related to the limit of the eye

source: །མིག་འཇུག་བསྟན་པ་ཐོས་གྱུར་ནས།
en: Heard teachings related to the cognition of the eye

source: །མིག་དབེན་བསྟན་པ་ཐོས་པས་ན།
en: Heard teachings related to the disengagement of the eye

source: །མིག་ལ་སྐྱེ་མེད་བསྟན་ཐོས་པས།
en: Heard teachings related to the unborn nature of the eye

source: །མིག་མེད་བསྟན་པ་ཐོས་པས་ན།
en: Heard teachings related to the nonexistence of the eye

source: །མིག་ནི་ཉེར་ཞི་བསྟན་ཐོས་པས།
en: Heard teachings related to the utter peace of the eye

source: །མིག་ལ་བདག་མེད་བསྟན་ཐོས་པས།
en: Heard teachings related to the absence of a self in the eye

source: །མིག་ལ་གང་ཟག་མེད་ཐོས་པས།
en: Heard teachings related to the absence of a person in the eye

source: །མིག་ལ་སེམས་ཅན་མེད་ཐོས་པས།
en: Heard teachings related to the absence of a sentient being in the eye

source: །མིག་ལ་སྲོག་མེད་ཐོས་པས་ན།
en: Heard teachings related to the absence of a life principle in the eye

source: །མིག་ལ་གསོ་བ་མེད་ཐོས་པས།
en: Heard teachings related to the absence of a soul in the eye

source: །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི།
en: Extensively expressed to sentient beings

source: །འཇིག་རྟེན་ཞེན་པ་རབ་སྨད་དེ།
en: His criticism of clinging to the world,

source: །ཞེན་པ་མི་སྐྱེད་ཉིད་དུ་མཛད།
en: Causing them to stop generating clinging.

source: །འཇིག་རྟེན་རྙེད་པ་རབ་སྨད་དེ།
en: His criticism of worldly wealth

source: །འདུས་མ་བྱས་ཀྱི་བསྔགས་བརྗོད་མཛད།
en: And his praises of the unconditioned.

source: །ཟག་བཅས་ཤེས་པ་རབ་སྨད་དེ།
en: His criticism of defilement

source: །ཟག་མེད་ཤེས་རབ་བསྔགས་པར་མཛད།
en: And his praises of undefiled insight.

source: །འཇིག་རྟེན་བསམ་གཏན་རབ་སྨད་དེ།
en: His criticism of worldly concentration

source: །འཇིག་རྟེན་འདས་པའི་ཏིང་འཛིན་བསྔགས།
en: And his praises of supramundane absorption.

source: །ཟག་བཅས་ཚུལ་ཁྲིམས་རབ་སྨད་དེ།
en: His criticism of defiled discipline

source: །ཟག་མེད་བསླབ་གནས་བསྔགས་པར་མཛད།
en: And his praises of undefiled precepts.

source: །སེམས་རྒྱ་ཆུང་ངུའི་སྐྱོན་བརྗོད་དེ།
en: The faults associated with narrow-mindedness,

source: །སེམས་རྒྱ་ཆེན་པོའི་ཡོན་ཏན་བསྔགས།
en: And praised the qualities of open-mindedness.

source: །ཐུགས་རྗེ་ཆེན་པོས་འཕྲུལ་བསྟན་ནས།
en: Through his miraculous displays, the great compassionate one Proclaimed the praises

source: །ལུས་ཀྱི་ཚུལ་ཁྲིམས་སེམས་ཤེས་རབ།
en: Of physical discipline

source: །ཟག་མེད་རྟེན་པ་མེད་པ་ཡི། །བསྔགས་པ་དག་ནི་བརྗོད་པར་མཛད།
en: And of undefiled and unsupported mental insight.

source: །སྡུག་བསྔལ་འགོག་པའི་ལམ་བསྔགས་ཤིང་།
en: Praised the path leading to the cessation of suffering.

source: །སྤྲོས་ལ་དགའ་ཞིང་ཞེན་པ་དག །སངས་རྒྱས་སྨད་པར་རབ་ཏུ་བསྟན།
en: The Buddha expressed his criticism Of those who indulge in and cling to thinking.

source: །མིག་ཟད་སྐྱོན་ནི་རབ་འབྱེད་ཅིང་།
en: The faults associated with the eye’s exhaustion,

source: །རབ་ཞི་མཚན་ཉིད་བསྟན་པར་མཛད།
en: And taught them the characteristics of utter peace. The same should also be applied to the ear, the nose,

source: །དར་ལ་བབ་ཅིང་གཞོན་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: With adulthood and youth.

source: །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ཆོ་རིགས་དག་ནི་སྙེམས་པ་ལ།
en: Extensively described to sentient beings

source: །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: The countless defects of the arrogance Related to one’s family lineage.

source: །ལོངས་སྤྱོད་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: With careless enjoyment.

source: །རང་དབང་བག་མེད་གྱུར་པ་ལ།
en: The countless defects associated

source: །གཟུགས་ཀྱིས་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: With physical carelessness.

source: །བུད་མེད་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: With carelessness with women.

source: །གོས་ཀྱིས་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: With carelessness related to clothing.

source: །ཐུག་རྗེ་ཆེན་པོ་འཕྲུལ་བསྟན་ནས།
en: Through his miraculous displays, the great compassionate one

source: །ཆང་གིས་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: With carelessness with liquor.

source: །རྒྱལ་པོ་བག་མེད་གྱུར་པ་ལ། །ཉེས་དམིགས་དཔག་མེད་ཡོད་པར་བསྟན།
en: The countless defects associated With the carelessness of kings.

source: །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ཚུལ་ཁྲིམས་སྙེམས་པར་གྱུར་པ་ལ།
en: Extensively described to sentient beings

source: །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ནི། །ཤེས་རབ་སྙེམས་པར་གྱུར་པ་ལ།
en: Extensively described to sentient beings

source: །དེ་བཞིན་རྟོགས་དང་རྫུ་འཕྲུལ་དང་། །བསམ་གཏན་མཁས་པའི་ང་རྒྱལ་དང་། །ནོར་དང་བཤད་དང་རིགས་དང་འཁོར།
en: The same applies to the pride related to Realization, miraculous powers, concentration, and erudition, To wealth, oration, family, retinues,

source: །རོལ་མོ་གླུ་དང་ལྕེ་རྒྱང་དང་། །གྲགས་པ་ཕུན་ཚོགས་བསྔགས་པ་དང་། །བཀུར་སྟི་དང་ནི་རྙེད་པ་དང་། །མཛེས་དང་གཡོ་སྒྱུ་ང་རྒྱལ་དང་། །ངོ་ཚ་མེད་དང་ཁྲེལ་མེད་དང་། །ཁེངས་དང་ཕུན་ཚོགས་ང་རྒྱལ་དང་། །བག་མེད་འདོད་ཆགས་དེ་བཞིན་ནོ།
en: Music, singing, eloquence, fame, excellence, praise, Veneration, acquisition, beauty, deceit, Frivolousness, lack of modesty, Haughtiness, accomplishment, and pride, As well as that related to carelessness and desire. Through his miraculous displays,

source: །སེམས་ཅན་གང་ཞིག་སེམས་དང་ཡིད། །དམན་པར་གྱུར་པ་དེ་དག་ལ།
en: To sentient beings with inferior mindsets and mental capacities.

source: །ཁྱད་པར་འཕགས་པའི་འདུ་ཤེས་བསྟན།
en: Through his miraculous displays,

source: །སེམས་ཅན་གང་ཞིག་རབ་ཞུམ་ཞིང་། །རྩོལ་བར་མི་བྱེད་དེ་དག་ལ།
en: To disheartened beings who lacked zeal.

source: །བརྩོན་འགྲུས་སྟོབས་ནི་སྟོན་པར་མཛད།
en: Through his miraculous displays,

source: །སེམས་ཅན་གང་ཞིག་ནོར་རྣམས་ལ། །ཆགས་པར་གྱུར་པ་དེ་དག་ལ། །ཆོག་ཤེས་ཆོས་ནི་སྟོན་པར་མཛད།
en: To sentient beings attached to wealth.

source: །གཞན་ཡང་སྤོས་ཀྱི་དྲི་གཙང་ཁང་།
en: Furthermore, he manifested perfumed chambers,

source: །མེ་ཏོག་དག་ནི་གཞལ་མེད་ཁང་།
en: Flowers, palaces,

source: །ཁང་པ་བརྩེགས་མ་མཆོག་སྤྲུལ་ནས།
en: And sublime storied mansions,

source: །སྤྲུལ་པའི་སངས་རྒྱས་བཞུགས་པར་བསྟན།
en: In addition to emanated buddhas who resided in them.

source: །གཞན་ཡང་ལྷ་ཡི་བུ་མོ་རྣམས།
en: He also manifested divine maidens

source: །མེ་ཏོག་ཙམ་པ་ཁང་པ་ན།
en: Residing in mansions made of magnolia flowers;

source: །གནས་པའི་ལུས་ཕྱེད་མངོན་སྤྲུལ་ནས།
en: The upper halves of their bodies were visible,

source: །མེ་ཏོག་ཕྲེང་ཐོགས་མཆོད་བྱེད་བསྟན།
en: And they worshiped him by holding up garlands of flowers. He also manifested asura maidens

source: །གཞན་ཡང་ལྷ་མིན་བུ་མོ་དག །མེ་ཏོག་མ་ལི་ཁང་པ་ན།
en: Residing in mansions made of jasmine flowers;

source: །གནས་པ་ལུས་ཕྱེད་བསྟན་སྤྲུལ་ནས།
en: The upper halves of their bodies were visible,

source: །གཞན་ཡང་ལྷ་ཡི་བུ་རྣམས་དག །པད་མ་སྔོན་པོའི་ཁང་པ་ན།
en: He also manifested gods Residing in mansions made of blue lotuses;

source: །སངས་རྒྱས་ཡོན་ཏན་བསྔགས་པ་བསྟན།
en: And they praised the Buddha’s qualities.

source: །གཞན་ཡང་ཚངས་པ་རྣམས་ཀྱི་ལྷ།
en: He also manifested gods of the Brahmā realms

source: །གསེར་གྱི་གཞལ་མེད་ཁང་པ་ན།
en: Residing in palaces made of gold;

source: །གནས་པ་ལུས་ཀུན་བསྟན་སྤྲུལ་ནས།
en: Their entire bodies were visible,

source: །སྒྲ་སྙན་སངས་རྒྱས་བསྔགས་པ་བསྟན།
en: And they praised the Buddha with their melodious voices.

source: །གཞན་ཡང་ལྷ་ཡི་བུ་མོ་དག །སྣ་ཚོགས་རྒྱན་གྱིས་ལུས་བརྒྱན་ཅིང་།
en: There were also goddesses whose bodies Were adorned with various ornaments, And these beautiful words manifested

source: །རྒྱན་ནི་ཕན་ཚུན་རེག་པ་ལས། །སྒྲ་སྙན་དག་ནི་རབ་བྱུང་ནས།
en: As their ornaments touched one another:

source: །འདུས་བྱས་རྣམས་ཀྱི་ཆོས་དག་ནི།
en: “Though all conditioned phenomena

source: །འགྱུར་ཞིང་མི་བརྟན་ཡིན་ན་ཡང་།
en: Are unstable and changing,

source: །བྱིས་པ་མི་བདེན་རྟོག་པ་ཡིས།
en: Immature beings, due to their mistaken conceptions,

source: །ཡང་དག་ཇི་བཞིན་མི་ཤེས་ཟེར།
en: Do not understand this reality as it is.”

source: །རྒྱན་གྱི་སྒྲ་ནི་དེ་དག་ཀྱང་།
en: The words that manifested from those ornaments

source: །ལུས་དང་སེམས་ལས་བྱུང་མ་ཡིན།
en: Came from neither the goddesses’ bodies nor their minds;

source: །འགྲོ་བ་མེད་ཅིང་འོང་བ་མེད།
en: They did not come from or go anywhere—

source: །ཕྱོགས་ཀྱང་ཡོད་པ་མ་ཡིན་ཏེ།
en: They were beyond directions.

source: །གཟུགས་དང་སེམས་ཀྱི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་སྦྱར་བར་བྱ།
en: The same should be applied to everything Up to forms and the mind.

source: །བྱིས་པ་རྣམས་ནི་མི་ཤེས་པས།
en: Still, due to their ignorance,

source: །འདི་ལ་ཐེ་ཚོམ་སྐྱེ་བར་འགྱུར།
en: Immature beings will entertain doubts about this.

source: །རྒྱན་གྱི་རྣམ་པ་དེ་དག་ལས། །སྒྲ་སྙན་བྱུང་བ་དེ་ཡིས་ནི།
en: Since the beautiful words Manifesting from those various ornaments

source: །སངས་རྒྱས་ཞིང་ཀུན་གྲགས་པས་ན།
en: Resounded in all the buddha realms,

source: །སེམས་ཅན་ཚད་མེད་གྲོལ་བར་གྱུར།
en: Countless sentient beings were liberated.

source: །དེ་ལྟ་བས་ན་ཁྱོད་རྣམས་ཀྱིས།
en: Therefore, you should regard as pure The Guide’s body and mind—

source: །འདྲེན་པའི་རང་བྱུང་ཡེ་ཤེས་དང་། །ཡོན་ཏན་དཔག་མེད་སྐུ་དག་ནི།
en: His self-manifest wisdom And his body endowed with boundless qualities.

source: །སྲེད་པའི་སྤྲོས་ལས་འདས་པ་དང་། །རབ་དབེན་སྐྱོན་ནི་མེད་པ་དང་། །ལྟ་བྲལ་སེམས་ནི་རབ་སྦྱངས་དང་། །མཚན་དང་དཔེ་བྱད་བརྒྱན་པ་དང་། །སྐུ་དང་ཐུགས་ནི་དག་པར་ལྟོས།
en: He has transcended craving’s proliferation, He is disengaged and faultless, His mind is purified and free from views, And he is adorned with the major and minor marks. You see how when the Blessed One

source: །ཁྱེད་ཀྱིས་བཅོམ་ལྡན་གྲོང་གཤེགས་ཚེ།
en: Came to the city,

source: །གོམ་པ་དག་ནི་སེང་གེ་འདྲ།
en: He walked like a lion,

source: །གཤེགས་སྟབས་ངང་པ་གླང་ཆེན་འདྲ།
en: He moved like a swan and like an elephant,

source: །སེམས་ཅན་རེ་བ་སྐོང་བར་མཛད།
en: He fulfilled the wishes of all sentient beings,

source: །བསོད་ནམས་ཁྱད་འཕགས་ཡོངས་སུ་རྫོགས།
en: He had perfected the most exalted form of merit,

source: །ཡང་དག་མཚན་གྱིས་རབ་ཏུ་བརྒྱན།
en: He was adorned with the authentic marks,

source: །སེམས་ཅན་དག་ནི་ཐམས་ཅད་ཀུན། །ལྟ་བས་མི་ངོམས་ཉིད་དུ་ལྟོས།
en: And all beings gazed at him insatiably.

source: །ཁྱོད་ཀྱིས་རྐང་གཉིས་གཙོ་ཡི་མཆོག །ཐུགས་རྗེ་ཆེན་པོ་ལྡན་པས་ན།
en: You see how since the supreme leader of human beings Was endowed with great compassion,

source: །དངོས་པོ་ཆུང་ངུས་མཆོད་བྱས་ཀྱང་།
en: The smallest gift offered to him

source: །ཡོན་ཏན་ཚད་མེད་འཐོབ་མཛད་པས། །སེམས་ཅན་དག་ནི་མང་པོ་རྣམས།
en: Caused one to gain immeasurable benefits;

source: །བསྐལ་པ་བརྒྱ་སྟོང་མང་པོར་ནི།
en: For many hundreds of thousands of eons,

source: །མྱ་ངན་འདས་པ་འཐོབ་པར་དུ།
en: Until the attainment of nirvāṇa, The karmic ripening of those many sentient beings
